/*************************************************************************
 @Author: XieXun
 @Created Time : Fri 27 Nov 10:22:39 2020
 @File Name: main.c
 @Description:
 ************************************************************************/

#include <stdio.h>

int main()
{
    // 这一题第一次做错了，因为最后一列，arithmetic！！！不明白为什么第二行和第四行 会在左面填上1，明明最高位是0啊
    // single byte
    // line 1 : 0xD4  11010100  01010000 0x50   00011010 0x1A   11111010 0xFA
    // line 2 : 0x64  01100100  10010000 0x90   00001100 0x0C   11101100 0xEC
    // line 3 : 0x72  01110010  11001000 0xC8   00001110 0x0E   00001110 0x0E
    // line 4 : 0x44  01000100  00010000 0x10   00001000 0x08   11101000 0xE8
    printf("------------这一题第一次做错了，因为最后一列，arithmetic！！！不明白为什么第二行和第四行 会在左面填上1，明明最高位是0啊------------\n");
    printf("line 1 :0xD4  11010100  01010000 0x50   00011010 0x1A   11111010 0xFA\n");
    printf("line 2 :0x64  01100100  10010000 0x90   00001100 0x0C   11101100 0xEC\n");
    printf("line 3 :0x72  01110010  11001000 0xC8   00001110 0x0E   00001110 0x0E\n");
    printf("line 4 :0x44  01000100  00010000 0x10   00001000 0x80   11101000 0xE8\n");
    return 0;
}
